**Pandas Serisi Oluşturma**

In [4]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
seri = pd.Series([1,2,3,4,5])

In [5]:
type(seri )

pandas.core.series.Series

In [6]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [8]:
seri.size

5

seri.ndim

In [9]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [11]:
seri.head((3)) #ilk 3 değeri verir

0    1
1    2
2    3
dtype: int64

In [13]:
seri.tail(3) # son 3 değeri verir

2    3
3    4
4    5
dtype: int64

In [16]:
pd.Series([99,2,332,94,5], index = [1,3,5,7,9])

1     99
3      2
5    332
7     94
9      5
dtype: int64

In [20]:
seri1 = pd.Series([99,2,332,94,5], index = ["a","b","c","d","e"])

In [21]:
seri1["a":"c"]

a     99
b      2
c    332
dtype: int64

In [22]:
# sozluk üzerinden liste oluşturmak

In [5]:
sozluk={"reg":10, "log":11, "cart":12}

In [6]:
seri=pd.Series(sozluk)

In [7]:
seri

reg     10
log     11
cart    12
dtype: int64

In [26]:
# iki seryi birleştirerek seri oluşturma

In [27]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

**Eleman İşlemleri**

In [32]:
import numpy as np
a = np.array([1,2,33,44,75])
seri = pd.Series(a)
seri

0     1
1     2
2    33
3    44
4    75
dtype: int32

In [14]:
seri[0]

1

In [15]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [34]:
seri = pd.Series([121,200,150,99], index = ["reg","log","cart","rf"])
seri

reg     121
log     200
cart    150
rf       99
dtype: int64

In [19]:
seri.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [20]:
seri.keys

<bound method Series.keys of reg     121
log     200
cart    150
rf       99
dtype: int64>

In [21]:
list(seri.items())

[('reg', 121), ('log', 200), ('cart', 150), ('rf', 99)]

In [30]:
seri.values

array([10, 11, 12], dtype=int64)

In [25]:
# eleman sorgulama

In [26]:
"reg" in seri

True

In [27]:
"a" in seri

False

In [28]:
# fancy eleman

In [35]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [36]:
seri["reg"]=130
seri["reg"]

130

In [37]:
seri

reg     130
log     200
cart    150
rf       99
dtype: int64

In [3]:
# Pandas dateFrama oluşturma = yapısal veri tipi.excel veri yapısına benzer

In [23]:
import pandas as pd

In [24]:
l = [1,2,39,58,90]

In [25]:
l

[1, 2, 39, 58, 90]

In [26]:
pd.DataFrame(l,columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             58
4             90

In [20]:
import numpy as np
m = np.arange(1,10).reshape((3,3))

In [21]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [30]:
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [34]:
df.columns=("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df.axes #özelliklerigösterir

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [37]:
df.shape

(3, 3)

In [38]:
df.ndim

2

In [39]:
df.size

9

In [40]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [41]:
type(df.values)

numpy.ndarray

df.tail(1)

In [52]:
a = np.array([1,2,3,4,5])
a

array([1, 2, 3, 4, 5])

In [54]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

**Eleman İşlemleri**

In [55]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2= np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [56]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}

In [57]:
sozluk

{'var1': array([9, 5, 2, 2, 6]),
 'var2': array([5, 1, 8, 1, 3]),
 'var3': array([6, 9, 0, 2, 7])}

In [60]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     9     5     6
1     5     1     9
2     2     8     0
3     2     1     2
4     6     3     7

In [61]:
df[0:1]

   var1  var2  var3
0     9     5     6

In [62]:
df.index = ["a","b","c","d","e"]

In [63]:
df

   var1  var2  var3
a     9     5     6
b     5     1     9
c     2     8     0
d     2     1     2
e     6     3     7

In [64]:
df["c":"e"]

   var1  var2  var3
c     2     8     0
d     2     1     2
e     6     3     7

In [78]:
#silme

In [65]:
df.drop("a", axis = 0)

   var1  var2  var3
b     5     1     9
c     2     8     0
d     2     1     2
e     6     3     7

In [66]:
df

   var1  var2  var3
a     9     5     6
b     5     1     9
c     2     8     0
d     2     1     2
e     6     3     7

In [77]:
df.drop("c", axis= 0, inplace = True) 
#kalıcı olmasını sağlar inplace
df

   var1  var2  var3
b     5     1     9
d     2     1     2
e     6     3     7

In [79]:
#fancy(fantastik)

In [82]:
l = ["b","e"]

In [83]:
df.drop(l, axis = 0)

   var1  var2  var3
d     2     1     2

In [84]:
#degiskenler için

In [85]:
df

   var1  var2  var3
b     5     1     9
d     2     1     2
e     6     3     7

In [86]:
"var1" in df

True

In [87]:
l = ["var1","var4","var2"]

In [88]:
for i in l:
    print(i in df)

True
False
True

In [89]:
df["var1"]

b    5
d    2
e    6
Name: var1, dtype: int32

In [92]:
df["var4"] = df["var1"] / df["var2"] # yeni elemen ekler

In [93]:
df

   var1  var2  var3  var4
b     5     1     9   5.0
d     2     1     2   2.0
e     6     3     7   2.0

In [94]:
#değişken silme

In [95]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     5     1     9
d     2     1     2
e     6     3     7

In [96]:
df

   var1  var2  var3  var4
b     5     1     9   5.0
d     2     1     2   2.0
e     6     3     7   2.0

In [97]:
df.drop("var4", axis = 1, inplace = True)

In [98]:
df

   var1  var2  var3
b     5     1     9
d     2     1     2
e     6     3     7

**Gözlem ve Değişken Seçimi: loc iloc**

In [99]:
import numpy as np
import pandas as pf
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    27    28     8
1    25    19     5
2     4     6    27
3    21    18    16
4     5    25    25
5    27     2     1
6    26    10    13
7    18    27     5
8    24    15    26
9    25    27    12

In [100]:
# loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [101]:
df.loc[0:3]

   var1  var2  var3
0    27    28     8
1    25    19     5
2     4     6    27
3    21    18    16

In [102]:
# iloc = alışık olduğumuz indeksleme mantığı ile seçim yapar

In [103]:
df.iloc[0:3]

   var1  var2  var3
0    27    28     8
1    25    19     5
2     4     6    27

In [104]:
df

   var1  var2  var3
0    27    28     8
1    25    19     5
2     4     6    27
3    21    18    16
4     5    25    25
5    27     2     1
6    26    10    13
7    18    27     5
8    24    15    26
9    25    27    12

In [105]:
df.iloc[:3,:2]

   var1  var2
0    27    28
1    25    19
2     4     6

In [106]:
df.loc[0:3, "var3"]

0     8
1     5
2    27
3    16
Name: var3, dtype: int32

In [107]:
df.iloc[0:3, "var3"] # loc kullanılmalı

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [108]:
df.iloc[0:3]["var3"]

0     8
1     5
2    27
Name: var3, dtype: int32

**Koşullu Eleman İşlemleri**

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size =(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     5     4     9
1    26     7     8
2    27    16    13
3    11     3    15
4    10    22    21
5    11    12    16
6    28    13    29
7     3    19    10
8    10    22    26
9     5    27    23

In [4]:
df["var1"]

0     5
1    26
2    27
3    11
4    10
5    11
6    28
7     3
8    10
9     5
Name: var1, dtype: int32

In [6]:
df["var1"][0:3]

0     5
1    26
2    27
Name: var1, dtype: int32

In [7]:
df[0:2][["var1","var2"]]

   var1  var2
0     5     4
1    26     7

In [9]:
df.var1

0     5
1    26
2    27
3    11
4    10
5    11
6    28
7     3
8    10
9     5
Name: var1, dtype: int32

In [12]:
df[df.var1 > 15]["var1"]

1    26
2    27
6    28
Name: var1, dtype: int32

In [14]:
df[(df.var1 > 15) & (df.var3 < 15)]

   var1  var2  var3
1    26     7     8
2    27    16    13

In [15]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
1    26     7
2    27    16
6    28    13

In [16]:
df[(df.var1 > 15)] [["var1","var2"]]

   var1  var2
1    26     7
2    27    16
6    28    13

**birleştirme(join) işlemleri**

In [18]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size =(5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    19    14     8
1    12     9     2
2    22    18     6
3     2    23     9
4     6     2    28

In [19]:
df2 = df1 + 99

In [21]:
df2

   var1  var2  var3
0   118   113   107
1   111   108   101
2   121   117   105
3   101   122   108
4   105   101   127

In [22]:
pd.concat([df1,df2])

   var1  var2  var3
0    19    14     8
1    12     9     2
2    22    18     6
3     2    23     9
4     6     2    28
0   118   113   107
1   111   108   101
2   121   117   105
3   101   122   108
4   105   101   127

In [ ]:
pd.concat([df1,df2])

In [25]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis=0,
    join='outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'FrameOrSeriesUnion'
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      a:\anaconda kurulumu\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [26]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0    19    14     8
1    12     9     2
2    22    18     6
3     2    23     9
4     6     2    28
5   118   113   107
6   111   108   101
7   121   117   105
8   101   122   108
9   105   101   127

In [27]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [28]:
df2.columns=["var1","var2","deg3"]

In [29]:
df2

   var1  var2  deg3
0   118   113   107
1   111   108   101
2   121   117   105
3   101   122   108
4   105   101   127

In [30]:
df1

   var1  var2  var3
0    19    14     8
1    12     9     2
2    22    18     6
3     2    23     9
4     6     2    28

In [32]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    19    14   8.0    NaN
1    12     9   2.0    NaN
2    22    18   6.0    NaN
3     2    23   9.0    NaN
4     6     2  28.0    NaN
0   118   113   NaN  107.0
1   111   108   NaN  101.0
2   121   117   NaN  105.0
3   101   122   NaN  108.0
4   105   101   NaN  127.0

In [34]:
pd.concat([df1,df2], join = "inner") #kesişimlerine göre birleştirir

   var1  var2
0    19    14
1    12     9
2    22    18
3     2    23
4     6     2
0   118   113
1   111   108
2   121   117
3   101   122
4   105   101

**ileri birleştirme işlemleri**

In [1]:
import pandas as pd

In [46]:
#birebir birleştirme

In [8]:
df1=pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                "grup":["Muhasebe","Muhendislik","Muhendislik","İK"]})

In [9]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [10]:
df2=pd.DataFrame({"calisanlar":["Ayse","Ali","Veli","Fatma"],
                  "ilk_giris":[2010,2009,2014,2019]})

In [11]:
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [68]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [67]:
?pd.merge

Signature:
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'str' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool' = True,
    indicator: 'bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

Parameters
----------
left : DataFrame
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      a:\anaconda kurulumu\lib\site-packages\pandas\core\reshape\merge.py
Type:      function

In [69]:
#çoktan teke

In [69]:
df3=pd.merge(df1, df2)

In [70]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [16]:
df4 = pd.DataFrame({"grup":["Muhasebe","Muhendislik","İK"],
                   "mudur":["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [71]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [18]:
# çoktan çoka

In [19]:
df5=pd.DataFrame({"grup":["muhasebe","muhasebe","muhendislik","muhendislik",
                         "İK","İK"],
                    "yetenekler":["matematik","excel","kodlama","lınux","excel","yönetim"]})
df5

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  muhendislik    kodlama
3  muhendislik      lınux
4           İK      excel
5           İK    yönetim

In [20]:
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Muhendislik
2       ayşe  Muhendislik
3      fatma           İK

In [40]:
pd.merge(df1,df5)

  calisanlar grup yetenekler
0      fatma   İK      excel
1      fatma   İK    yönetim

In [27]:
df5["yetenekler"]

0    matematik
1        excel
2      kodlama
3        lınux
4        excel
5      yönetim
Name: yetenekler, dtype: object

**______________________________________________________**

**Toplulaştırma ve Gruplama(aggregation & grouping)**

Basit toplulaştırma fonksiyonları:
* count()
* first()
* last()
* mean()
* medlan()
* min()
* max()
* std()
* var()
* sum()

In [42]:
!pip.install seaborn

'pip.install' is not recognized as an internal or external command,
operable program or batch file.

In [18]:
import seaborn as sns

In [44]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      a:\anaconda kurulumu\lib\site-packages\seaborn\utils.py
Type:      function

In [45]:
df = sns.load_dataset("planets")

In [47]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [48]:
df.shape

(1035, 6)

In [50]:
df.mean()

C:\Users\Aysun\AppData\Local\Temp/ipykernel_18204/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [51]:
df["mass"].mean()

2.6381605847953233

In [52]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [54]:
df["mass"].count()

513

In [55]:
df["mass"].var()

14.58183312700122

In [56]:
df["mass"].sum()

1353.37638

In [60]:
df.describe() # veri setindeki tüm değişkenleri betimsel istatistiksel olarak verir.

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [62]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [65]:
df.dropna().describe().T # eksik gözlemleri siler.veri setinde eksik değerler olduğu anlaşılırçç

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

**Gruplama işlemleri**

In [12]:
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "veri":[10,11,52,43,23,55]}, columns = ["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    43
4       B    23
5       C    55

In [13]:
df.groupby("gruplar")

In [14]:
df.groupby("gruplar").mean()

         veri
gruplar
A        26.5
B        17.0
C        53.5

In [16]:
df.groupby("gruplar").sum()

         veri
gruplar
A          53
B          34
C         107

In [21]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [23]:
df.groupby("method")

In [25]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [26]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [27]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

**İleri Toplulaştırma işlemleri (aggregate,filter,transform,apply)**

In [28]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["a","b","c","a","b","c"],
                  "degisken1": [10,20,33,11,99,41],
                  "degisken3":[100,253,333,256,111,578]},
                 columns = ["gruplar","degisken1","degisken3"])
df

  gruplar  degisken1  degisken3
0       a         10        100
1       b         20        253
2       c         33        333
3       a         11        256
4       b         99        111
5       c         41        578

In [29]:
#aggregate

In [30]:
df.groupby("gruplar").mean()

         degisken1  degisken3
gruplar
a             10.5      178.0
b             59.5      182.0
c             37.0      455.5

In [32]:
df.groupby("gruplar")["degisken1"].mean()

gruplar
a    10.5
b    59.5
c    37.0
Name: degisken1, dtype: float64

In [34]:
import numpy as np 
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken3
              min median max       min median  max
gruplar
a              10   10.5  11       100  178.0  256
b              20   59.5  99       111  182.0  253
c              33   37.0  41       333  455.5  578

In [37]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken3": "max"})

         degisken1  degisken3
gruplar
a               10        256
b               20        253
c               33        578